Autodesk.Revit.DB.Lighting.CircleLightShape.#ctor(Autodesk.Revit.DB.Lighting.CircleLightShape)
Creates a copy of the given circle light shape
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2013